Repository: DrAbcOfficial/FidoManager
Catalog: src/Fido2.Manager/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans

# AppTitle
source: FIDO2 Manager
zh_hans: FIDO2 管理工具

# StatusReady
source: Ready
zh_hans: 就绪

source: (unnamed)
zh_hans: (未命名)

# CommonOk
source: OK
zh_hans: 确定

# CommonCancel
source: Cancel
zh_hans: 取消

# CommonConfirm
source: Confirm
zh_hans: 确认

# CommonClose
source: Close
zh_hans: 关闭

# CommonApply
source: Apply
zh_hans: 应用

# NotifyTitleHint
source: Notice
zh_hans: 提示

# PromptSelectDeviceFirst
source: Select a device first.
zh_hans: 请先选择设备。

source: on
zh_hans: 开

source: off
zh_hans: 关

# DeviceLabel
source: Device:
zh_hans: 设备:

# RefreshButton
source: Refresh
zh_hans: 刷新

# NavDeviceInfo
source: Device info
zh_hans: 设备信息

# NavCredentials
source: Credentials
zh_hans: 凭据

# NavFingerprints
source: Fingerprints
zh_hans: 指纹

# NavPolicy
source: Policy
zh_hans: 策略

# NavReset
source: Factory reset
zh_hans: 恢复出厂

# LanguageLabel
source: Language:
zh_hans: 语言:

# LanguageAuto
source: Automatic (system default)
zh_hans: 自动(跟随系统)

# LanguageDialogTitle
source: Language
zh_hans: 语言设置

# LanguageRestartPrompt
source: The language change takes effect after the app restarts. Restart now?
zh_hans: 语言设置将在重启应用后生效。要现在重启吗?

source: Restart now
zh_hans: 立即重启

source: Later
zh_hans: 稍后

# BannerElevated
source: Running as administrator — all features available.
zh_hans: 已以管理员身份运行 — 全部功能可用。

# BannerNotElevated
source: Not elevated — USB HID cannot be opened (0x5). Please rerun as administrator.
zh_hans: 未提权 — USB HID 无法打开(0x5),请以管理员身份重新运行。

# ScanningDevices
source: Scanning for devices…
zh_hans: 正在扫描设备…

# DevicesFound
source: {0} device(s) found
zh_hans: 找到 {0} 台设备

# SelectDevicePrompt
source: Select a device
zh_hans: 请选择设备

# NoDevicesFound
source: No devices found — plug in a key or place the card on an NFC reader
zh_hans: 未找到设备 — 插入钥匙或将卡片放到 NFC 读卡器上

# ScanFailed
source: Scan failed: {0}
zh_hans: 扫描失败:{0}

# Connecting
source: Connecting to {0}…
zh_hans: 正在连接 {0}…

# SerialNumberLabel
source: S/N {0}
zh_hans: 串号 {0}

source: Connected
zh_hans: 已连接

# ConnectFailed
source: Connection failed
zh_hans: 连接失败

# ConnectFailedWithReason
source: Connection failed: {0}
zh_hans: 连接失败:{0}

source: No device selected
zh_hans: 未选择设备

# RowDevice
source: Device
zh_hans: 设备

# RowSerialVendor
source: Serial (vendor)
zh_hans: 串号(厂商)

# RowVersions
source: Versions
zh_hans: 版本

# RowExtensions
source: Extensions
zh_hans: 扩展

# RowMaxMessageSize
source: Max message size
zh_hans: 最大消息大小

# BytesValue
source: {0} bytes
zh_hans: {0} 字节

# RowPinProtocol
source: PIN protocol
zh_hans: PIN 协议

# RowMinPinLength
source: Min PIN length
zh_hans: 最小 PIN 长度

# RowFirmwareVersion
source: Firmware version
zh_hans: 固件版本

# RowTransport
source: Transport
zh_hans: 传输

# PinSetWithRetries
source: Set ({0} retries remaining)
zh_hans: 已设置(剩余 {0} 次重试)

# PinNotSet
source: Not set
zh_hans: 未设置

# RowCapabilities
source: Capabilities
zh_hans: 能力

# CapPinSet
source: PIN set
zh_hans: PIN 已设置

# CapNoPin
source: No PIN
zh_hans: 无 PIN

# CapFingerprint
source: Fingerprint
zh_hans: 指纹

# CapCredentialMgmt
source: Credential management
zh_hans: 凭据管理

# CapAuthnrConfig
source: Config commands
zh_hans: 策略配置

# CapForcePinChange
source: PIN change required
zh_hans: 要求改 PIN

source: Device info loaded
zh_hans: 设备信息已加载

# DeviceInfoFailed
source: Failed to read device info: {0}
zh_hans: 读取设备信息失败:{0}

# CredsListButton
source: List credentials
zh_hans: 列出凭据

# CredsDeleteButton
source: Delete selected
zh_hans: 删除选中

# CredsNotLoaded
source: Not loaded yet. Click “List credentials” — a PIN will be required.
zh_hans: 尚未加载。点击“列出凭据” — 将需要 PIN。

# CredsNeedPin
source: Listing credentials requires the PIN.
zh_hans: 列出凭据需要 PIN。

# CredsUnsupportedTitle
source: Not supported
zh_hans: 不支持

# CredsUnsupportedMessage
source: This key does not provide the credential management API.
zh_hans: 这把钥匙没有提供凭据管理 API。

source: Reading credentials…
zh_hans: 正在读取凭据…

# CredsStoredFree
source: {0} stored {1} slots free
zh_hans: 已存 {0} 剩余可存 {1}

# CredsStored
source: {0} stored
zh_hans: 已存 {0}

# NoResidentCredentials
source: No discoverable (resident) credentials on this key.
zh_hans: 这把钥匙上没有可发现( resident )凭据。

# CredentialsListed
source: {0} credential(s)
zh_hans: 共 {0} 条凭据

# DeleteCredentialTitle
source: Delete credential
zh_hans: 删除凭据

# DeleteCredentialConfirm
source: Delete this credential? {0} / {1} This action cannot be undone.
zh_hans: 删除这条凭据? {0} / {1} 此操作不可撤销。

# DeleteCredentialNeedPin
source: Deleting a credential requires the PIN.
zh_hans: 删除凭据需要 PIN。

source: Deleting credential…
zh_hans: 正在删除凭据…

source: Credential deleted
zh_hans: 凭据已删除

# BioListButton
source: List
zh_hans: 列出

# BioEnrollButton
source: Enroll new
zh_hans: 录入新指纹

# BioRenameButton
source: Rename
zh_hans: 重命名

# BioDeleteButton
source: Delete
zh_hans: 删除

# BioNotLoaded
source: Not loaded yet. Click “List” — a PIN will be required.
zh_hans: 尚未加载。点击“列出” — 将需要 PIN。

# NoBioSensor
source: This key has no fingerprint sensor (getInfo does not advertise bioEnroll).
zh_hans: 这把钥匙没有指纹传感器(getInfo 未提供 bioEnroll)。

# BioListNeedPin
source: Listing fingerprints requires the PIN.
zh_hans: 列出指纹需要 PIN。

# NoFingerprints
source: No fingerprints on this key.
zh_hans: 这把钥匙上没有指纹。

# FingerprintsListed
source: {0} fingerprint(s)
zh_hans: 共 {0} 枚指纹

# EnrollTitle
source: Enroll fingerprint
zh_hans: 录入指纹

# EnrollNamePrompt
source: Name this finger (optional):
zh_hans: 为这根手指命名(可选):

# EnrollNeedPin
source: Enrolling a fingerprint requires the PIN.
zh_hans: 录入指纹需要 PIN。

# EnrollWaitFirstTouch
source: Waiting for first touch…
zh_hans: 等待第一次触摸…

# EnrollInstruction
source: Touch the sensor repeatedly until enrollment completes.
zh_hans: 反复触摸传感器,直到录入完成。

# EnrollingTitle
source: Enrolling fingerprint
zh_hans: 正在录入指纹

# Enrolling
source: Enrolling fingerprint…
zh_hans: 正在录入指纹…

# TouchSensor
source: Touch the sensor…
zh_hans: 请触摸传感器…

# SampleProgress
source: {0} — {1} more sample(s) needed
zh_hans: {0} — 还需 {1} 次

# Enrolled
source: Fingerprint enrolled ({0})
zh_hans: 指纹已录入({0})

# EnrollCanceled
source: Enrollment canceled
zh_hans: 录入已取消

# RenameTitle
source: Rename fingerprint
zh_hans: 重命名指纹

# RenamePrompt
source: New name:
zh_hans: 新名称:

# RenameNeedPin
source: Renaming requires the PIN.
zh_hans: 重命名需要 PIN。

source: Renamed
zh_hans: 已重命名

# DeleteFingerprintTitle
source: Delete fingerprint
zh_hans: 删除指纹

# DeleteFingerprintConfirm
source: Delete this fingerprint? {0} This action cannot be undone.
zh_hans: 删除这枚指纹? {0} 此操作不可撤销。

# DeleteFingerprintNeedPin
source: Deleting a fingerprint requires the PIN.
zh_hans: 删除指纹需要 PIN。

source: Fingerprint deleted
zh_hans: 指纹已删除

# BioSample00
source: Good sample captured.
zh_hans: 样本良好,已采集。

# BioSample01
source: Sample too high or partial — try again.
zh_hans: 样本偏上或不完整 — 请重试。

# BioSample02
source: Sample too low or partial — try again.
zh_hans: 样本偏下或不完整 — 请重试。

# BioSample03
source: Sample partial — center your finger on the sensor.
zh_hans: 样本不完整 — 请将手指对准传感器中央。

# BioSample04
source: Too many failed samples — enrollment may need restarting.
zh_hans: 失败次数过多 — 录入可能需要重新开始。

# BioSample05
source: Low quality — clean the sensor and your finger, then retry.
zh_hans: 样本质量差 — 请清洁传感器和手指后重试。

# BioSample06
source: Too similar to the previous sample — adjust finger position.
zh_hans: 与上一个样本太接近 — 请调整手指位置。

# BioSample07
source: Sensor timeout — touch the sensor.
zh_hans: 传感器超时 — 请触摸传感器。

# BioSampleOther
source: Retry the sample.
zh_hans: 请重新采集。

# PinCheckButton
source: Check PIN state
zh_hans: 检查 PIN 状态

# PinCurrentLabel
source: Current PIN:
zh_hans: 当前 PIN:

# PinNewLabel
source: New PIN (4–63 bytes):
zh_hans: 新 PIN(4–63 字节):

# PinConfirmLabel
source: Confirm new PIN:
zh_hans: 确认新 PIN:

# PinApplyButton
source: Apply
zh_hans: 应用

# PinInitialState
source: Select a device, then click “Check”.
zh_hans: 选择设备后点击“检查”。

# PinNotSetFirstTime
source: No PIN is set. Leave “Current PIN” empty to set one for the first time.
zh_hans: 未设置 PIN。“当前 PIN”留空即为首次设置。

source: PIN state checked
zh_hans: PIN 状态已检查

# PinMismatchTitle
source: PINs do not match
zh_hans: PIN 不一致

# PinMismatchMessage
source: The two new PINs are not identical.
zh_hans: 两次输入的新 PIN 不相同。

# PinTooShortTitle
source: PIN too short
zh_hans: PIN 太短

# PinTooShortMessage
source: A PIN must be at least 4 bytes.
zh_hans: PIN 至少需要 4 个字节。

# PinCurrentRequiredTitle
source: Current PIN required
zh_hans: 缺少当前 PIN

# PinCurrentRequiredMessage
source: The key already has a PIN; changing it requires the current PIN.
zh_hans: 钥匙已设置 PIN,修改需要当前 PIN。

source: Changing PIN…
zh_hans: 正在修改 PIN…

source: Setting PIN…
zh_hans: 正在设置 PIN…

source: PIN changed
zh_hans: PIN 已修改

source: PIN set
zh_hans: PIN 已设置

# PolicyAlwaysUvTitle
source: Always require user verification (alwaysUv)
zh_hans: 始终要求用户验证(alwaysUv)

# PolicyAlwaysUvDesc
source: Every assertion requires the PIN or a fingerprint, even when the relying party does not ask for it. Whether this toggle survives a factory reset depends on the vendor.
zh_hans: 每次断言都需要 PIN 或指纹,即使服务端未要求。此开关是否能在恢复出厂后保留取决于厂商。

# PolicyMinPinTitle
source: Minimum PIN length
zh_hans: 最小 PIN 长度

# PolicyMinPinDesc
source: Raise the shortest PIN the key accepts. It can only be raised — lowering it requires a factory reset. If the current PIN is shorter than the new minimum, the key forces a PIN change itself.
zh_hans: 提高钥匙接受的最短 PIN。只能调高 — 调回需要恢复出厂。若当前 PIN 短于新下限,钥匙会自行强制改 PIN。

# PolicyApplyMinPinButton
source: Apply
zh_hans: 应用

# PolicyForceChangeTitle
source: Force PIN change on next use
zh_hans: 下次使用时强制改 PIN

# PolicyForceChangeDesc
source: The current PIN remains valid until it is changed. Useful before handing the key to someone else.
zh_hans: 当前 PIN 在更改前继续有效。适合在把钥匙交给他人之前使用。

# PolicyForceChangeButton
source: Force PIN change
zh_hans: 强制改 PIN

# PolicyInitialState
source: Policy state loads after a device is selected.
zh_hans: 选择设备后加载策略状态。

# ToggleButtonDefault
source: Toggle
zh_hans: 切换

# PolicyNoDevice
source: No device selected.
zh_hans: 未选择设备。

# AlwaysUvCurrentlyOn
source: Currently: on
zh_hans: 当前:开

# AlwaysUvCurrentlyOff
source: Currently: off
zh_hans: 当前:关

# AlwaysUvUnreported
source: Currently: not reported
zh_hans: 当前:未报告

source: Disable alwaysUv
zh_hans: 关闭 alwaysUv

source: Enable alwaysUv
zh_hans: 开启 alwaysUv

# PolicyConfigSupported
source: This key supports authenticatorConfig.
zh_hans: 此钥匙支持 authenticatorConfig。

# PolicyConfigNoSetMinPin
source: This key supports authenticatorConfig but not setMinPINLength — the length control is unavailable.
zh_hans: 此钥匙支持 authenticatorConfig,但不含 setMinPINLength — 长度控件不可用。

# PolicyConfigUnsupported
source: This key does not provide authenticatorConfig — policy changes are unavailable.
zh_hans: 此钥匙不提供 authenticatorConfig — 策略修改不可用。

# AlwaysUvNeedPin
source: Changing alwaysUv requires the PIN.
zh_hans: 修改 alwaysUv 需要 PIN。

source: Toggling alwaysUv…
zh_hans: 正在切换 alwaysUv…

# AlwaysUvNow
source: alwaysUv is now {0}
zh_hans: alwaysUv 现在为 {0}

# RaiseMinPinTitle
source: Raise minimum PIN length
zh_hans: 提高最小 PIN 长度

# RaiseMinPinConfirm
source: Raise the minimum PIN length to {0}? This can only be raised — lowering it requires a factory reset (wiping all credentials).
zh_hans: 将最小 PIN 长度提高到 {0}? 此设置只能调高 — 调回必须恢复出厂(清空所有凭据)。

# MinPinNeedPin
source: Changing the minimum PIN length requires the PIN.
zh_hans: 修改最小 PIN 长度需要 PIN。

# SettingMinPin
source: Setting minimum PIN length…
zh_hans: 正在设置最小 PIN 长度…

# MinPinNow
source: Minimum PIN length is now {0}
zh_hans: 最小 PIN 长度现为 {0}

# ForcePinChangeTitle
source: Force PIN change on next use
zh_hans: 强制下次改 PIN

# ForcePinChangeConfirm
source: A new PIN must be set the next time this key is used. Useful before handing the key over.
zh_hans: 下次使用此钥匙时必须设置新的 PIN。适合在转交钥匙前使用。

# ForcePinChangeNeedPin
source: Forcing a PIN change requires the PIN.
zh_hans: 强制改 PIN 需要 PIN。

# ForcePinChangeSet
source: Set: a PIN change will be forced on next use
zh_hans: 已设置:下次使用时强制改 PIN

# ResetWarningMain
source: A factory reset wipes all passkeys and the PIN on this key. This cannot be undone.
zh_hans: 恢复出厂将清空此钥匙上的全部 passkey 与 PIN,此操作不可撤销。

# ResetWarningCritical
source: Be sure to unplug and re-insert the key first.
zh_hans: 请务必先拔插钥匙。

# ResetWindowHint
source: The key only accepts a reset for about 10 seconds after power-up: unplug and re-insert it (or move it away from and back onto the NFC reader), then immediately click the button below.
zh_hans: 钥匙只在上电后约 10 秒内接受重置:请先拔下再插回(或从 NFC 感应区移开再放回),然后立即点击下面的按钮。

# ResetButton
source: Factory reset
zh_hans: 恢复出厂设置

# ResetTitle
source: Factory reset
zh_hans: 恢复出厂设置

# ResetConfirm
source: A factory reset wipes all passkeys and the PIN on this key and cannot be undone. The key only accepts a reset for about 10 seconds after power-up: unplug and re-insert it (or move it away from and back onto the NFC reader), then immediately click “Confirm”. Continue?
zh_hans: 恢复出厂会清空此钥匙上的全部 passkey 与 PIN,且不可撤销。 钥匙只在上电后约 10 秒内接受重置:请先拔下再插回(或从 NFC 感应区移开再放回),然后立即点击“确认”。 确定继续?

source: Resetting…
zh_hans: 正在恢复出厂…

# ResetDone
source: Factory reset complete. All credentials and the PIN have been cleared.
zh_hans: 已恢复出厂。全部凭据与 PIN 已清除。

# PinDialogTitle
source: PIN required
zh_hans: 需要 PIN

# RememberPinThisSession
source: Remember for this session (never persisted)
zh_hans: 本次会话内记住(不落盘)

# NoCardOnReader
source: No card on reader {0}.
zh_hans: 读卡器 {0} 上没有卡片。
